## [접근자 Accesor]
- Series/DataFrame의 데이터가 날짜시간(datetime),문자열(object),범주형(Category)등의 경우 데이터타입과 관련된 전용의 함수들을 상요할 수 있도록
해주는 속성
- Series.str. 문자열처리관련함수명()
- Series.dt.날짜시간처리관련 속성명

(1) 모듈로딩

In [1]:
import pandas as pd

(2)데이터 준비

In [2]:
datas={'name':['홍 길동','이 나영','마 징가','베 토벤'],
       "age":[10,21,73,89],
       "reg_date": ["2000/01/23","2020/11/8","1999/5/4","1987/12/24"]}

datas2=[['홍 길동','이 나영','마 징가','베 토벤'],
       [10,21,73,89],
       ["2000/01/23","2020/11/8","1999/5/4","1987/12/24"]]

(3) 데이터 저장

In [3]:
#리스트/튜플=> df
# 딕셔너리=> df 
# 차이는?

#들어가는 형태가 달라짐///

In [4]:
df1=pd.DataFrame(datas)  # 딕셔너리=> df 
df1

   name  age    reg_date
0  홍 길동   10  2000/01/23
1  이 나영   21   2020/11/8
2  마 징가   73    1999/5/4
3  베 토벤   89  1987/12/24

In [5]:
df1=pd.DataFrame(datas2)    #리스트/튜플=> df
df1

            0          1         2           3
0        홍 길동       이 나영      마 징가        베 토벤
1          10         21        73          89
2  2000/01/23  2020/11/8  1999/5/4  1987/12/24

(4)데이터 정보 확인

In [6]:
# 데이터의 전체 기본 정보 => info()

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      object
 2   2       3 non-null      object
 3   3       3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

(5) 데이터 전처리

- (5-1) 행<==>열 치환

In [8]:
df1.T

      0   1           2
0  홍 길동  10  2000/01/23
1  이 나영  21   2020/11/8
2  마 징가  73    1999/5/4
3  베 토벤  89  1987/12/24

In [9]:
df1=df1.transpose()

In [10]:
df1

      0   1           2
0  홍 길동  10  2000/01/23
1  이 나영  21   2020/11/8
2  마 징가  73    1999/5/4
3  베 토벤  89  1987/12/24

- (5-2) 실제 데이터와 타입 확인 후  형 변환

In [11]:
# 1번컬럼 : object=> 정수
df1[1]=df1[1].astype('uint8')  #u=부호 없음  뒤의 숫자, 개수가 적을때 효과적

In [12]:
df1.dtypes

0    object
1     uint8
2    object
dtype: object

In [13]:
#2번 컬럼:object=> datetime64[ns]
df1[2]=df1[2].astype('datetime64[ns]')

-(5-3) 0번 컬럼의 이름을 성과 이름으로 분리 하기

In [14]:
#0번 컬럼만 추출 => Series
nameSR=df1[0]
nameSR

0    홍 길동
1    이 나영
2    마 징가
3    베 토벤
Name: 0, dtype: object

In [15]:
# "이 나영 " 데이터를 추출 => 성과 이름으로 분린
# type(nameSR[1]),nameSR[1].upper(),nameSR[1].split()

In [16]:
# for idx in range(nameSR.shape[0]):
#     print(nameSR[idx])
#     nameSR[idx]=nameSR[idx].split
# nameSR

In [17]:
namesDF=nameSR.str.split(expand=True)
df1,namesDF

(      0   1          2
 0  홍 길동  10 2000-01-23
 1  이 나영  21 2020-11-08
 2  마 징가  73 1999-05-04
 3  베 토벤  89 1987-12-24,
    0   1
 0  홍  길동
 1  이  나영
 2  마  징가
 3  베  토벤)

-(5-4) 두개의 DataFrame을 컬럼방향으로 연결

In [18]:
pd.concat([df1,namesDF],axis='columns',ignore_index=True)  #ignore_index=True 행 인덱스 바꾸기,join='outer'- 열 이름 합집

      0   1          2  3   4
0  홍 길동  10 2000-01-23  홍  길동
1  이 나영  21 2020-11-08  이  나영
2  마 징가  73 1999-05-04  마  징가
3  베 토벤  89 1987-12-24  베  토벤

- (5-5) 2번 컬럼에서 년,월,일을 분리

In [19]:
df1[2]

0   2000-01-23
1   2020-11-08
2   1999-05-04
3   1987-12-24
Name: 2, dtype: datetime64[ns]

In [20]:
yearSR=df1[2].dt.year 
#연만 추출
yearSR

0    2000
1    2020
2    1999
3    1987
Name: 2, dtype: int32

In [21]:
pd.concat([df1,yearSR],axis=1,ignore_index=True)

      0   1          2     3
0  홍 길동  10 2000-01-23  2000
1  이 나영  21 2020-11-08  2020
2  마 징가  73 1999-05-04  1999
3  베 토벤  89 1987-12-24  1987

- (5-6) 현재 DataFrame을 파일로 저장하기 => pandas.to_XXX("파일경로+파일명)

In [22]:
# csv==> 데이터와 데이터의 구분자
filename="./backup.csv"    #backup.csv

In [25]:
df1.to_csv(filename,sep=" ",header=False,index=False)

In [28]:
pd.read_csv(filename,header=None,sep=' ')

      0   1           2
0  홍 길동  10  2000-01-23
1  이 나영  21  2020-11-08
2  마 징가  73  1999-05-04
3  베 토벤  89  1987-12-24

In [30]:
# df1.append(namesDF])